Thank you @LaurentLesle.

If anyone needs a working example:

main.tf:

```
terraform {
  required_providers {
  }
  required_version = ">= 0.15"
}

provider "azurerm" {
  features {
    key_vault {
      purge_soft_delete_on_destroy = var.provider_azurerm_features_keyvault.purge_soft_delete_on_destroy
    }
  }
}

provider "azurerm" {
  alias                      = "vhub"
  skip_provider_registration = true
  features {}
  subscription_id = data.azurerm_client_config.default.subscription_id
  tenant_id       = data.azurerm_client_config.default.tenant_id
}

data "azurerm_client_config" "default" {}

variable "global_settings" {
  default = {}
}

variable "resource_groups" {
  default = {}
}

variable "logged_user_objectId" {
  default = {}
}

variable "provider_azurerm_features_keyvault" {
  default = {
    purge_soft_delete_on_destroy = true
  }
}

module "caf" {
  source  = "aztfmod/caf/azurerm"
  version = ">=5.4.2"

  providers = {
    azurerm.vhub = azurerm.vhub
  }

  global_settings             = var.global_settings
  resource_groups             = var.resource_groups
  logged_user_objectId        = var.logged_user_objectId
}
```
terraform.auto.tfvars:

```
global_settings = {
  default_region = "region1"
  environment    = "dev"
  regions = {
    region1 = "northeurope"
  }
}

resource_groups = {
  region1 = {
    name   = "rg01"
    region = "region1"
  }
}
```

```
export TF_VAR_logged_user_objectId=$(az ad signed-in-user show --query id -o tsv --only-show-errors)
```
or (for powershell)
```
$env:TF_VAR_logged_user_objectId=$(az ad signed-in-user show --query id -o tsv --only-show-errors)
```
```
terraform init
terraform plan
```

output:
```
data.azurerm_client_config.default: Reading...
data.azurerm_client_config.default: Read complete after 0s [id=2022-06-03 09:56:17.1526044 +0000 UTC]
module.caf.data.azurerm_client_config.current: Reading...
module.caf.data.azurerm_subscription.primary: Reading...
module.caf.data.azurerm_client_config.current: Read complete after 0s [id=2022-06-03 09:56:18.3891044 +0000 UTC]
module.caf.data.azurerm_subscription.primary: Read complete after 1s [id=/subscriptions/a0a1db5d-####-####-abd4-d953b09bdb81]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.caf.random_string.prefix[0] will be created
  + resource "random_string" "prefix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.caf.module.resource_groups["region1"].azurecaf_name.rg will be created
  + resource "azurecaf_name" "rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "rg01"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.caf.module.resource_groups["region1"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```